# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge on one-to-many and many-to-many relationships!

## Objectives

You will be able to:
- Query data using one-to-many and many-to-many joins
- Predict the resulting size of one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='images/Database-Schema.png' width="600">

## Connect to the Database

In [1]:
#Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = conn.cursor()

## Employees and their Office (a One-to-One join)

Return a list of all of the employees with their first name, last name and the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [6]:
#Your code here
cur.execute('''SELECT firstName, lastName, city, state
               FROM employees JOIN offices USING(officeCode)
               ORDER BY firstName, lastName
               ''')
df = pd.DataFrame(cur.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in cur.description]
df.head()

  firstName lastName           city state
0      Andy   Fixter         Sydney
1   Anthony      Bow  San Francisco    CA
2     Barry    Jones         London
3     Diane   Murphy  San Francisco    CA
4  Foon Yue    Tseng            NYC    NY

## Customers and their Orders (a One-to-Many join)

Return a list of all the customers first and last names along with a record for each of their order numbers, order dates and statuses.

In [4]:
# Your code here
cur.execute('''SELECT contactFirstName, contactLastName, orderNumber, orderDate, status
               FROM customers JOIN orders USING(customerNumber)
               ORDER BY contactFirstName, contactLastName
               ''')
df = pd.DataFrame(cur.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in cur.description]
df.head()

  contactFirstName contactLastName orderNumber   orderDate      status
0           Adrian          Huxley       10139  2003-07-16     Shipped
1           Adrian          Huxley       10270  2004-07-19     Shipped
2           Adrian          Huxley       10361  2004-12-17     Shipped
3           Adrian          Huxley       10420  2005-05-29  In Process
4            Akiko       Shimamura       10258  2004-06-15     Shipped

## Customers and their Payments (another One-to-Many join)

Return a list of customers first and last names along with details about their payments including the amount and date of payments. Sort these results in descending order by the payment amount.

In [5]:
# Your code here
cur.execute('''SELECT contactFirstName, contactLastName, paymentDate, amount
               FROM customers JOIN payments USING(customerNumber)
               ORDER BY amount DESC;
               ''')
df = pd.DataFrame(cur.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in cur.description]
df.head()

  contactFirstName contactLastName paymentDate   amount
0          Violeta         Benitez  2003-11-08  9977.85
1              Ben        Calaghan  2003-10-17  9821.32
2           Leslie          Taylor  2004-12-06  9658.74
3             Sean        Clenahan  2004-07-28  9415.13
4          Roland           Mendel  2005-05-03  8807.12

## Orders, Order details and Product Details (a Many-to-Many Join)

Return a list of customer first and last names, product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries which can make complex queries such as this much simpler!

In [7]:
# Your code here
cur.execute('''SELECT contactFirstName, contactLastName, productName, quantityOrdered, orderNumber, orderDate
               FROM customers JOIN orders USING(customerNumber)
                              JOIN orderdetails USING(orderNumber)
                              JOIN products USING(P)
               ORDER BY orderDate DESC
               ''')
df = pd.DataFrame(cur.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in cur.description]
df.head()

OperationalError: no such column: productName

## Summary

In this lab, you practiced your knowledge on one-to-many and many-to-many relationships!